package exceptions.lesson_1;
//Реализуйте метод, принимающий в качестве аргумента целочисленный двумерный массив. Необходимо посчитать и вернуть сумму элементов этого массива.
//        При этом накладываем на метод 2 ограничения: метод может работать только с квадратными массивами (кол-во строк = кол-ву столбцов), и в каждой ячейке может лежать только значение 0 или 1.
//        Если нарушается одно из условий, метод должен вернуть код ошибки.
//        Программа должна корректно обработать код ошибки и вывести соответствующее сообщение пользователю.
//        Сравнить такой вариант обработки исключений с предыдущим.
//        Какое преимущество у исключений перед
//        кодами ошибок вы можете назвать
//        в данном случае?
public class Main4 {
    public static void main(String[] args) {

    }
}
